; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=47, out_folder=htg/blocksworld/training, instance_id=27, seed=2051

(define (problem blocksworld-27)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 - object)
 (:init 
    (arm-empty)
    (clear b33)
    (on b33 b18)
    (on b18 b9)
    (on b9 b47)
    (on b47 b32)
    (on b32 b5)
    (on b5 b21)
    (on-table b21)
    (clear b25)
    (on b25 b34)
    (on b34 b7)
    (on b7 b38)
    (on b38 b42)
    (on b42 b17)
    (on b17 b4)
    (on b4 b39)
    (on-table b39)
    (clear b20)
    (on b20 b1)
    (on b1 b26)
    (on b26 b2)
    (on b2 b16)
    (on b16 b45)
    (on b45 b24)
    (on b24 b13)
    (on b13 b31)
    (on b31 b27)
    (on b27 b40)
    (on b40 b15)
    (on b15 b11)
    (on b11 b23)
    (on b23 b19)
    (on b19 b29)
    (on b29 b3)
    (on-table b3)
    (clear b44)
    (on b44 b41)
    (on b41 b43)
    (on b43 b37)
    (on b37 b10)
    (on b10 b46)
    (on b46 b36)
    (on b36 b12)
    (on b12 b8)
    (on b8 b6)
    (on b6 b22)
    (on b22 b30)
    (on b30 b35)
    (on b35 b28)
    (on b28 b14)
    (on-table b14))
 (:goal  (and 
    (clear b3)
    (on b3 b4)
    (on b4 b2)
    (on b2 b1)
    (on-table b1))))

; plan
1. (unstack b20 b1)
   deleted: (on b20 b1) (clear b20) (arm-empty)
   added: (holding b20) (clear b1)
   goals met: 0 of 5
2. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 0 of 5
3. (unstack b1 b26)
   deleted: (on b1 b26) (clear b1) (arm-empty)
   added: (holding b1) (clear b26)
   goals met: 0 of 5
4. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 5
5. (unstack b26 b2)
   deleted: (on b26 b2) (clear b26) (arm-empty)
   added: (holding b26) (clear b2)
   goals met: 1 of 5
6. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 1 of 5
7. (unstack b2 b16)
   deleted: (on b2 b16) (clear b2) (arm-empty)
   added: (holding b2) (clear b16)
   goals met: 1 of 5
8. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 2 of 5
9. (unstack b16 b45)
   deleted: (on b16 b45) (clear b16) (arm-empty)
   added: (holding b16) (clear b45)
   goals met: 2 of 5
10. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 2 of 5
11. (unstack b45 b24)
   deleted: (on b45 b24) (clear b45) (arm-empty)
   added: (holding b45) (clear b24)
   goals met: 2 of 5
12. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 2 of 5
13. (unstack b25 b34)
   deleted: (on b25 b34) (clear b25) (arm-empty)
   added: (holding b25) (clear b34)
   goals met: 2 of 5
14. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 2 of 5
15. (unstack b34 b7)
   deleted: (on b34 b7) (clear b34) (arm-empty)
   added: (holding b34) (clear b7)
   goals met: 2 of 5
16. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 2 of 5
17. (unstack b7 b38)
   deleted: (on b7 b38) (clear b7) (arm-empty)
   added: (holding b7) (clear b38)
   goals met: 2 of 5
18. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 5
19. (unstack b38 b42)
   deleted: (on b38 b42) (clear b38) (arm-empty)
   added: (holding b38) (clear b42)
   goals met: 2 of 5
20. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 2 of 5
21. (unstack b42 b17)
   deleted: (on b42 b17) (clear b42) (arm-empty)
   added: (holding b42) (clear b17)
   goals met: 2 of 5
22. (putdown b42)
   deleted: (holding b42)
   added: (clear b42) (arm-empty) (on-table b42)
   goals met: 2 of 5
23. (unstack b17 b4)
   deleted: (on b17 b4) (clear b17) (arm-empty)
   added: (holding b17) (clear b4)
   goals met: 2 of 5
24. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 2 of 5
25. (unstack b4 b39)
   deleted: (on b4 b39) (clear b4) (arm-empty)
   added: (holding b4) (clear b39)
   goals met: 2 of 5
26. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 3 of 5
27. (unstack b24 b13)
   deleted: (on b24 b13) (clear b24) (arm-empty)
   added: (holding b24) (clear b13)
   goals met: 3 of 5
28. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 3 of 5
29. (unstack b13 b31)
   deleted: (on b13 b31) (clear b13) (arm-empty)
   added: (holding b13) (clear b31)
   goals met: 3 of 5
30. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 3 of 5
31. (unstack b31 b27)
   deleted: (on b31 b27) (clear b31) (arm-empty)
   added: (holding b31) (clear b27)
   goals met: 3 of 5
32. (putdown b31)
   deleted: (holding b31)
   added: (clear b31) (arm-empty) (on-table b31)
   goals met: 3 of 5
33. (unstack b27 b40)
   deleted: (on b27 b40) (clear b27) (arm-empty)
   added: (holding b27) (clear b40)
   goals met: 3 of 5
34. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 3 of 5
35. (unstack b40 b15)
   deleted: (on b40 b15) (clear b40) (arm-empty)
   added: (holding b40) (clear b15)
   goals met: 3 of 5
36. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 5
37. (unstack b15 b11)
   deleted: (on b15 b11) (clear b15) (arm-empty)
   added: (holding b15) (clear b11)
   goals met: 3 of 5
38. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 3 of 5
39. (unstack b11 b23)
   deleted: (on b11 b23) (clear b11) (arm-empty)
   added: (holding b11) (clear b23)
   goals met: 3 of 5
40. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 3 of 5
41. (unstack b23 b19)
   deleted: (on b23 b19) (clear b23) (arm-empty)
   added: (holding b23) (clear b19)
   goals met: 3 of 5
42. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 3 of 5
43. (unstack b19 b29)
   deleted: (on b19 b29) (clear b19) (arm-empty)
   added: (holding b19) (clear b29)
   goals met: 3 of 5
44. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 3 of 5
45. (unstack b29 b3)
   deleted: (on b29 b3) (clear b29) (arm-empty)
   added: (holding b29) (clear b3)
   goals met: 4 of 5
46. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 4 of 5
47. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 3 of 5
48. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 5 of 5
